In [1]:
# import nltk
# nltk.download('popular')

%run package_import.ipynb
%run data_profiling.ipynb

In [2]:
from sqlalchemy import create_engine
import pymysql

sqlEngine       = create_engine('mysql+pymysql://root:@127.0.0.1/nlp_with_disaster_tweets', pool_recycle=3600)
dbConnection    = sqlEngine.connect()

In [3]:
import os
os.chdir(path='/Users/liuyifu/Project_data')

### Train data

#### Read train data

In [4]:
df_train = pd.read_csv('nlp_with_disaster_tweets/train.csv')

#### Upload train data into mysql

In [5]:
df_train.to_sql('raw_train', dbConnection, if_exists='replace', index=False)

### Profile train data

In [6]:
main_data_profiling(df_train)

,column_names,data_type,unique_count,min_value,max_value,mean_value,median_value,null_values,total_rows,%_null_values,num_lower_outliers,num_higher_outliers
0,id,int64,7613,1.0,10873.0,5441.934848,5408.0,0,7613,0.000000,0.0,0.0
1,keyword,object,222,NaN,NaN,NaN,NaN,61,7613,0.008013,NaN,NaN
2,location,object,3342,NaN,NaN,NaN,NaN,2533,7613,0.332720,NaN,NaN
3,text,object,7503,NaN,NaN,NaN,NaN,0,7613,0.000000,NaN,NaN
4,target,int64,2,0.0,1.0,0.429660,0.0,0,7613,0.000000,0.0,0.0

### Test data

#### Read test data

In [9]:
df_test = pd.read_csv('nlp_with_disaster_tweets/test.csv')
df_test.to_sql('raw_test', dbConnection, if_exists='replace', index=False)

In [10]:
main_data_profiling(df_test)

,column_names,data_type,unique_count,min_value,max_value,mean_value,median_value,null_values,total_rows,%_null_values,num_lower_outliers,num_higher_outliers
0,id,int64,3263,0.0,10875.0,5427.152927,5500.0,0,3263,0.000000,0.0,0.0
1,keyword,object,222,NaN,NaN,NaN,NaN,26,3263,0.007968,NaN,NaN
2,location,object,1603,NaN,NaN,NaN,NaN,1105,3263,0.338645,NaN,NaN
3,text,object,3243,NaN,NaN,NaN,NaN,0,3263,0.000000,NaN,NaN

In [ ]:
df_train = pd.read_sql_query(
    '''
    select *
    from raw_train
    '''

,dbConnection)
df_train